Revit 2027 API
BuiltInFailures.ConnectorFailures.NetworkValidityErrorWasDisconnected Property
 The family is connected in a network and can no longer keep the connectivity. Disconnect the family from the network?
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NetworkValidityErrorWasDisconnected { get; }
Public Shared ReadOnly Property NetworkValidityErrorWasDisconnected As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NetworkValidityErrorWasDisconnected {
	FailureDefinitionId^ get ();
}
static member NetworkValidityErrorWasDisconnected : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ConnectorFailures Class
Autodesk.Revit.DB Namespace